MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM706/mcu.h
#define U3MODE U3MODE
extern volatile uint16_t U3MODE __attribute__((__sfr__));
__extension__ typedef struct tagU3MODEBITS {
  union {
    struct {
      uint16_t STSEL:1;
      uint16_t PDSEL:2;
      uint16_t BRGH:1;
      uint16_t URXINV:1;
      uint16_t ABAUD:1;
      uint16_t LPBACK:1;
      uint16_t WAKE:1;
      uint16_t UEN:2;
      uint16_t :1;
      uint16_t RTSMD:1;
      uint16_t IREN:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t PDSEL0:1;
      uint16_t PDSEL1:1;
      uint16_t :1;
      uint16_t RXINV:1;
      uint16_t :3;
      uint16_t UEN0:1;
      uint16_t UEN1:1;
    };
  };
} U3MODEBITS;
extern volatile U3MODEBITS U3MODEbits __attribute__((__sfr__));

#define U3STA U3STA
extern volatile uint16_t U3STA __attribute__((__sfr__));
__extension__ typedef struct tagU3STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t :1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
      uint16_t :6;
      uint16_t TXINV:1;
    };
  };
} U3STABITS;
extern volatile U3STABITS U3STAbits __attribute__((__sfr__));

#define U3TXREG U3TXREG
extern volatile uint16_t U3TXREG __attribute__((__sfr__));
#define U3RXREG U3RXREG
extern volatile uint16_t U3RXREG __attribute__((__sfr__));
#define U3BRG U3BRG
extern volatile uint16_t U3BRG __attribute__((__sfr__));

#define SPI2 SPI2
extern volatile SPI SPI2 __attribute__((__sfr__));

#define SPI2STAT SPI2STAT
extern volatile uint16_t SPI2STAT __attribute__((__sfr__));
__extension__ typedef struct tagSPI2STATBITS {
  union {
    struct {
      uint16_t SPIRBF:1;
      uint16_t SPITBF:1;
      uint16_t SISEL:3;
      uint16_t SRXMPT:1;
      uint16_t SPIROV:1;
      uint16_t SRMPT:1;
      uint16_t SPIBEC:3;
      uint16_t :2;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :2;
      uint16_t SISEL0:1;
      uint16_t SISEL1:1;
      uint16_t SISEL2:1;
      uint16_t :3;
      uint16_t SPIBEC0:1;
      uint16_t SPIBEC1:1;
      uint16_t SPIBEC2:1;
    };
  };
} SPI2STATBITS;
extern volatile SPI2STATBITS SPI2STATbits __attribute__((__sfr__));

#define SPI2CON1 SPI2CON1
extern volatile uint16_t SPI2CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON1BITS {
  union {
    struct {
      uint16_t PPRE:2;
      uint16_t SPRE:3;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t DISSDO:1;
      uint16_t DISSCK:1;
    };
    struct {
      uint16_t PPRE0:1;
      uint16_t PPRE1:1;
      uint16_t SPRE0:1;
      uint16_t SPRE1:1;
      uint16_t SPRE2:1;
    };
  };
} SPI2CON1BITS;
extern volatile SPI2CON1BITS SPI2CON1bits __attribute__((__sfr__));

#define SPI2CON2 SPI2CON2
extern volatile uint16_t SPI2CON2 __attribute__((__sfr__));
typedef struct tagSPI2CON2BITS {
  uint16_t SPIBEN:1;
  uint16_t FRMDLY:1;
  uint16_t :11;
  uint16_t FRMPOL:1;
  uint16_t SPIFSD:1;
  uint16_t FRMEN:1;
} SPI2CON2BITS;
extern volatile SPI2CON2BITS SPI2CON2bits __attribute__((__sfr__));

#define SPI2BUF SPI2BUF
extern volatile uint16_t SPI2BUF __attribute__((__sfr__));
#define DCICON1 DCICON1
extern volatile uint16_t DCICON1 __attribute__((__sfr__));
__extension__ typedef struct tagDCICON1BITS {
  union {
    struct {
      uint16_t COFSM:2;
      uint16_t :3;
      uint16_t DJST:1;
      uint16_t CSDOM:1;
      uint16_t UNFM:1;
      uint16_t COFSD:1;
      uint16_t CSCKE:1;
      uint16_t CSCKD:1;
      uint16_t DLOOP:1;
      uint16_t :1;
      uint16_t DCISIDL:1;
      uint16_t :1;
      uint16_t DCIEN:1;
    };
    struct {
      uint16_t COFSM0:1;
      uint16_t COFSM1:1;
    };
  };
} DCICON1BITS;
extern volatile DCICON1BITS DCICON1bits __attribute__((__sfr__));

#define DCICON2 DCICON2
extern volatile uint16_t DCICON2 __attribute__((__sfr__));
__extension__ typedef struct tagDCICON2BITS {
  union {
    struct {
      uint16_t WS:4;
      uint16_t :1;
      uint16_t COFSG:4;
      uint16_t :1;
      uint16_t BLEN:2;
    };
    struct {
      uint16_t WS0:1;
      uint16_t WS1:1;
      uint16_t WS2:1;
      uint16_t WS3:1;
      uint16_t :1;
      uint16_t COFSG0:1;
      uint16_t COFSG1:1;
      uint16_t COFSG2:1;
      uint16_t COFSG3:1;
      uint16_t :1;
      uint16_t BLEN0:1;
      uint16_t BLEN1:1;
    };
  };
} DCICON2BITS;
extern volatile DCICON2BITS DCICON2bits __attribute__((__sfr__));

#define DCICON3 DCICON3
extern volatile uint16_t DCICON3 __attribute__((__sfr__));
__extension__ typedef struct tagDCICON3BITS {
  union {
    struct {
      uint16_t BCG:12;
    };
    struct {
      uint16_t BCG0:1;
      uint16_t BCG1:1;
      uint16_t BCG2:1;
      uint16_t BCG3:1;
      uint16_t BCG4:1;
      uint16_t BCG5:1;
      uint16_t BCG6:1;
      uint16_t BCG7:1;
      uint16_t BCG8:1;
      uint16_t BCG9:1;
      uint16_t BCG10:1;
      uint16_t BCG11:1;
    };
  };
} DCICON3BITS;
extern volatile DCICON3BITS DCICON3bits __attribute__((__sfr__));

#define DCISTAT DCISTAT
extern volatile uint16_t DCISTAT __attribute__((__sfr__));
__extension__ typedef struct tagDCISTATBITS {
  union {
    struct {
      uint16_t TMPTY:1;
      uint16_t TUNF:1;
      uint16_t RFUL:1;
      uint16_t ROV:1;
      uint16_t :4;
      uint16_t SLOT:4;
    };
    struct {
      uint16_t :8;
      uint16_t SLOT0:1;
      uint16_t SLOT1:1;
      uint16_t SLOT2:1;
      uint16_t SLOT3:1;
    };
  };
} DCISTATBITS;
extern volatile DCISTATBITS DCISTATbits __attribute__((__sfr__));

#define TSCON TSCON
extern volatile uint16_t TSCON __attribute__((__sfr__));
typedef struct tagTSCONBITS {
  uint16_t TSE0:1;
  uint16_t TSE1:1;
  uint16_t TSE2:1;
  uint16_t TSE3:1;
  uint16_t TSE4:1;
  uint16_t TSE5:1;
  uint16_t TSE6:1;
  uint16_t TSE7:1;
  uint16_t TSE8:1;
  uint16_t TSE9:1;
  uint16_t TSE10:1;
  uint16_t TSE11:1;
  uint16_t TSE12:1;
  uint16_t TSE13:1;
  uint16_t TSE14:1;
  uint16_t TSE15:1;
} TSCONBITS;
extern volatile TSCONBITS TSCONbits __attribute__((__sfr__));

#define RESERVED1 RESERVED1
extern volatile uint16_t RESERVED1 __attribute__((__sfr__));
#define RSCON RSCON
extern volatile uint16_t RSCON __attribute__((__sfr__));
typedef struct tagRSCONBITS {
  uint16_t RSE0:1;
  uint16_t RSE1:1;
  uint16_t RSE2:1;
  uint16_t RSE3:1;
  uint16_t RSE4:1;
  uint16_t RSE5:1;
  uint16_t RSE6:1;
  uint16_t RSE7:1;
  uint16_t RSE8:1;
  uint16_t RSE9:1;
  uint16_t RSE10:1;
  uint16_t RSE11:1;
  uint16_t RSE12:1;
  uint16_t RSE13:1;
  uint16_t RSE14:1;
  uint16_t RSE15:1;
} RSCONBITS;
extern volatile RSCONBITS RSCONbits __attribute__((__sfr__));

