MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM706/mcu.h
#define _C1FMSKSEL1_F1MSK0_POSITION              0x00000002
#define _C1FMSKSEL1_F1MSK0_MASK                  0x00000004
#define _C1FMSKSEL1_F1MSK0_LENGTH                0x00000001

#define _C1FMSKSEL1_F1MSK1_POSITION              0x00000003
#define _C1FMSKSEL1_F1MSK1_MASK                  0x00000008
#define _C1FMSKSEL1_F1MSK1_LENGTH                0x00000001

#define _C1FMSKSEL1_F2MSK0_POSITION              0x00000004
#define _C1FMSKSEL1_F2MSK0_MASK                  0x00000010
#define _C1FMSKSEL1_F2MSK0_LENGTH                0x00000001

#define _C1FMSKSEL1_F2MSK1_POSITION              0x00000005
#define _C1FMSKSEL1_F2MSK1_MASK                  0x00000020
#define _C1FMSKSEL1_F2MSK1_LENGTH                0x00000001

#define _C1FMSKSEL1_F3MSK0_POSITION              0x00000006
#define _C1FMSKSEL1_F3MSK0_MASK                  0x00000040
#define _C1FMSKSEL1_F3MSK0_LENGTH                0x00000001

#define _C1FMSKSEL1_F3MSK1_POSITION              0x00000007
#define _C1FMSKSEL1_F3MSK1_MASK                  0x00000080
#define _C1FMSKSEL1_F3MSK1_LENGTH                0x00000001

#define _C1FMSKSEL1_F4MSK0_POSITION              0x00000008
#define _C1FMSKSEL1_F4MSK0_MASK                  0x00000100
#define _C1FMSKSEL1_F4MSK0_LENGTH                0x00000001

#define _C1FMSKSEL1_F4MSK1_POSITION              0x00000009
#define _C1FMSKSEL1_F4MSK1_MASK                  0x00000200
#define _C1FMSKSEL1_F4MSK1_LENGTH                0x00000001

#define _C1FMSKSEL1_F5MSK0_POSITION              0x0000000A
#define _C1FMSKSEL1_F5MSK0_MASK                  0x00000400
#define _C1FMSKSEL1_F5MSK0_LENGTH                0x00000001

#define _C1FMSKSEL1_F5MSK1_POSITION              0x0000000B
#define _C1FMSKSEL1_F5MSK1_MASK                  0x00000800
#define _C1FMSKSEL1_F5MSK1_LENGTH                0x00000001

#define _C1FMSKSEL1_F6MSK0_POSITION              0x0000000C
#define _C1FMSKSEL1_F6MSK0_MASK                  0x00001000
#define _C1FMSKSEL1_F6MSK0_LENGTH                0x00000001

#define _C1FMSKSEL1_F6MSK1_POSITION              0x0000000D
#define _C1FMSKSEL1_F6MSK1_MASK                  0x00002000
#define _C1FMSKSEL1_F6MSK1_LENGTH                0x00000001

#define _C1FMSKSEL1_F7MSK0_POSITION              0x0000000E
#define _C1FMSKSEL1_F7MSK0_MASK                  0x00004000
#define _C1FMSKSEL1_F7MSK0_LENGTH                0x00000001

#define _C1FMSKSEL1_F7MSK1_POSITION              0x0000000F
#define _C1FMSKSEL1_F7MSK1_MASK                  0x00008000
#define _C1FMSKSEL1_F7MSK1_LENGTH                0x00000001

#define _C1FMSKSEL2_F8MSK_POSITION               0x00000000
#define _C1FMSKSEL2_F8MSK_MASK                   0x00000003
#define _C1FMSKSEL2_F8MSK_LENGTH                 0x00000002

#define _C1FMSKSEL2_F9MSK_POSITION               0x00000002
#define _C1FMSKSEL2_F9MSK_MASK                   0x0000000C
#define _C1FMSKSEL2_F9MSK_LENGTH                 0x00000002

#define _C1FMSKSEL2_F10MSK_POSITION              0x00000004
#define _C1FMSKSEL2_F10MSK_MASK                  0x00000030
#define _C1FMSKSEL2_F10MSK_LENGTH                0x00000002

#define _C1FMSKSEL2_F11MSK_POSITION              0x00000006
#define _C1FMSKSEL2_F11MSK_MASK                  0x000000C0
#define _C1FMSKSEL2_F11MSK_LENGTH                0x00000002

#define _C1FMSKSEL2_F12MSK_POSITION              0x00000008
#define _C1FMSKSEL2_F12MSK_MASK                  0x00000300
#define _C1FMSKSEL2_F12MSK_LENGTH                0x00000002

#define _C1FMSKSEL2_F13MSK_POSITION              0x0000000A
#define _C1FMSKSEL2_F13MSK_MASK                  0x00000C00
#define _C1FMSKSEL2_F13MSK_LENGTH                0x00000002

#define _C1FMSKSEL2_F14MSK_POSITION              0x0000000C
#define _C1FMSKSEL2_F14MSK_MASK                  0x00003000
#define _C1FMSKSEL2_F14MSK_LENGTH                0x00000002

#define _C1FMSKSEL2_F15MSK_POSITION              0x0000000E
#define _C1FMSKSEL2_F15MSK_MASK                  0x0000C000
#define _C1FMSKSEL2_F15MSK_LENGTH                0x00000002

#define _C1FMSKSEL2_F8MSK0_POSITION              0x00000000
#define _C1FMSKSEL2_F8MSK0_MASK                  0x00000001
#define _C1FMSKSEL2_F8MSK0_LENGTH                0x00000001

#define _C1FMSKSEL2_F8MSK1_POSITION              0x00000001
#define _C1FMSKSEL2_F8MSK1_MASK                  0x00000002
#define _C1FMSKSEL2_F8MSK1_LENGTH                0x00000001

#define _C1FMSKSEL2_F9MSK0_POSITION              0x00000002
#define _C1FMSKSEL2_F9MSK0_MASK                  0x00000004
#define _C1FMSKSEL2_F9MSK0_LENGTH                0x00000001

#define _C1FMSKSEL2_F9MSK1_POSITION              0x00000003
#define _C1FMSKSEL2_F9MSK1_MASK                  0x00000008
#define _C1FMSKSEL2_F9MSK1_LENGTH                0x00000001

#define _C1FMSKSEL2_F10MSK0_POSITION             0x00000004
#define _C1FMSKSEL2_F10MSK0_MASK                 0x00000010
#define _C1FMSKSEL2_F10MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F10MSK1_POSITION             0x00000005
#define _C1FMSKSEL2_F10MSK1_MASK                 0x00000020
#define _C1FMSKSEL2_F10MSK1_LENGTH               0x00000001

#define _C1FMSKSEL2_F11MSK0_POSITION             0x00000006
#define _C1FMSKSEL2_F11MSK0_MASK                 0x00000040
#define _C1FMSKSEL2_F11MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F11MSK1_POSITION             0x00000007
#define _C1FMSKSEL2_F11MSK1_MASK                 0x00000080
#define _C1FMSKSEL2_F11MSK1_LENGTH               0x00000001

#define _C1FMSKSEL2_F12MSK0_POSITION             0x00000008
#define _C1FMSKSEL2_F12MSK0_MASK                 0x00000100
#define _C1FMSKSEL2_F12MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F12MSK1_POSITION             0x00000009
#define _C1FMSKSEL2_F12MSK1_MASK                 0x00000200
#define _C1FMSKSEL2_F12MSK1_LENGTH               0x00000001

#define _C1FMSKSEL2_F13MSK0_POSITION             0x0000000A
#define _C1FMSKSEL2_F13MSK0_MASK                 0x00000400
#define _C1FMSKSEL2_F13MSK0_LENGTH               0x00000001

#define _C1FMSKSEL2_F13MSK1_POSITION             0x0000000B
#define _C1FMSKSEL2_F13MSK1_MASK                 0x00000800
#define _C1FMSKSEL2_F13MSK1_LENGTH               0x00000001

